#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
azurerm_resource_group.RG_CPE: Refreshing state... [id=/subscriptions/77bb0b07-57e5-44b5-a350-310a93917298/resourceGroups/CPE-POC]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azuread_user.AF-4 will be created
  + resource "azuread_user" "AF-4" {
      + about_me                       = (known after apply)
      + account_enabled                = true
      + business_phones                = (known after apply)
      + company_name                   = "CPE"
      + creation_type                  = (known after apply)
      + department                     = "Administratif"
      + disable_password_expiration    = false
      + disable_strong_password        = false
      + display_name                   = "Barack Afritt"
      + external_user_state            = (known after apply)
      + force_password_change          = false
      + id                             = (known after apply)
      + im_addresses                   = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = "barack.afritt"
      + object_id                      = (known after apply)
      + onpremises_distinguished_name  = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_immutable_id        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + onpremises_user_principal_name = (known after apply)
      + password                       = (sensitive value)
      + proxy_addresses                = (known after apply)
      + show_in_address_list           = true
      + user_principal_name            = "barack.afritt@AxFrancoiscpe.onmicrosoft.com"
      + user_type                      = (known after apply)
    }

  # azuread_user.AF-5 will be created
  + resource "azuread_user" "AF-5" {
      + about_me                       = (known after apply)
      + account_enabled                = true
      + business_phones                = (known after apply)
      + company_name                   = "CPE"
      + creation_type                  = (known after apply)
      + department                     = "Administratif"
      + disable_password_expiration    = false
      + disable_strong_password        = false
      + display_name                   = "Annie-Zette Auffray"
      + external_user_state            = (known after apply)
      + force_password_change          = false
      + id                             = (known after apply)
      + im_addresses                   = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = "annie-zette.auffray"
      + object_id                      = (known after apply)
      + onpremises_distinguished_name  = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_immutable_id        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + onpremises_user_principal_name = (known after apply)
      + password                       = (sensitive value)
      + proxy_addresses                = (known after apply)
      + show_in_address_list           = true
      + user_principal_name            = "annie-zette.auffray@AxFrancoiscpe.onmicrosoft.com"
      + user_type                      = (known after apply)
    }

  # azuread_user.IT-1 will be created
  + resource "azuread_user" "IT-1" {
      + about_me                       = (known after apply)
      + account_enabled                = true
      + business_phones                = (known after apply)
      + company_name                   = "CPE"
      + creation_type                  = (known after apply)
      + department                     = "IT"
      + disable_password_expiration    = false
      + disable_strong_password        = false
      + display_name                   = "Jean Cive"
      + external_user_state            = (known after apply)
      + force_password_change          = false
      + id                             = (known after apply)
      + im_addresses                   = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = "jean.cive"
      + object_id                      = (known after apply)
      + onpremises_distinguished_name  = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_immutable_id        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + onpremises_user_principal_name = (known after apply)
      + password                       = (sensitive value)
      + proxy_addresses                = (known after apply)
      + show_in_address_list           = true
      + user_principal_name            = "jean.cive@AxFrancoiscpe.onmicrosoft.com"
      + user_type                      = (known after apply)
    }

  # azuread_user.IT-2 will be created
  + resource "azuread_user" "IT-2" {
      + about_me                       = (known after apply)
      + account_enabled                = true
      + business_phones                = (known after apply)
      + company_name                   = "CPE"
      + creation_type                  = (known after apply)
      + department                     = "IT"
      + disable_password_expiration    = false
      + disable_strong_password        = false
      + display_name                   = "Sarah Croche"
      + external_user_state            = (known after apply)
      + force_password_change          = false
      + id                             = (known after apply)
      + im_addresses                   = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = "sara.croche"
      + object_id                      = (known after apply)
      + onpremises_distinguished_name  = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_immutable_id        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + onpremises_user_principal_name = (known after apply)
      + password                       = (sensitive value)
      + proxy_addresses                = (known after apply)
      + show_in_address_list           = true
      + user_principal_name            = "sarah.croche@AxFrancoiscpe.onmicrosoft.com"
      + user_type                      = (known after apply)
    }

  # azuread_user.IT-3 will be created
  + resource "azuread_user" "IT-3" {
      + about_me                       = (known after apply)
      + account_enabled                = true
      + business_phones                = (known after apply)
      + company_name                   = "CPE"
      + creation_type                  = (known after apply)
      + department                     = "IT"
      + disable_password_expiration    = false
      + disable_strong_password        = false
      + display_name                   = "Hubert Bonisseur-Delabath"
      + external_user_state            = (known after apply)
      + force_password_change          = false
      + id                             = (known after apply)
      + im_addresses                   = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = "hubert.bonisseur-delabath"
      + object_id                      = (known after apply)
      + onpremises_distinguished_name  = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_immutable_id        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + onpremises_user_principal_name = (known after apply)
      + password                       = (sensitive value)
      + proxy_addresses                = (known after apply)
      + show_in_address_list           = true
      + user_principal_name            = "hubert.bonisseur-delabath@AxFrancoiscpe.onmicrosoft.com"
      + user_type                      = (known after apply)
    }

  # azurerm_network_security_group.example will be created
  + resource "azurerm_network_security_group" "example" {
      + id                  = (known after apply)
      + location            = "francecentral"
      + name                = "example-security-group"
      + resource_group_name = "CPE-POC"
      + security_rule       = (known after apply)
    }

  # azurerm_virtual_network.System-network-1 will be created
  + resource "azurerm_virtual_network" "System-network-1" {
      + address_space       = [
          + "192.168.0.0/24",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "francecentral"
      + name                = "System-network-1"
      + resource_group_name = "CPE-POC"
      + subnet              = [
          + {
              + address_prefix = "192.168.0.0/25"
              + id             = (known after apply)
              + name           = "subnet1"
              + security_group = ""
            },
          + {
              + address_prefix = "192.168.0.128/25"
              + id             = (known after apply)
              + name           = "subnet2"
              + security_group = ""
            },
        ]
      + tags                = {
          + "environment" = "System"
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @AxFrancois, Action: `pull_request`, Workflow: `Terraform Plan`*